/*
 * [q1.cpp]
 * 信息学堂2021 课后作业 Day 2 Question 1
 * 
 * 信息学堂第二次的作业会带大家熟悉表达式，分支与简单循环
 * 请根据注释里的相应提示，完成 *TODO* 部分的作业内容
 * 
 * © Tina J, 2021
 * 作者：Tina Ji
 * 时间：27/06/2021
 * 版本：1.0.0
 */

#include <iostream>
using namespace std;

// TODO:
// 请先思考下列表达式的类型以及值，再用程序验证你的猜想
// 1. 算术表达式，优先级乘除大于加减，值是算术值。类型由操作数决定。
// 6 * 5 / 3 - 4 + 5
// -------------------------------------
// 2. 逻辑表达式 类型是bool型
// 5 && 6 || 0
// -------------------------------------
// 3. 综合运用
// !a && ++b  // 其中 a = 8 ， b = 2
int main(void) {

    return 0;
}