/*
 * [q3.cpp]
 * 信息学堂2021 课后作业 Day 2 Question 3
 * 
 * 信息学堂第二次的作业会带大家熟悉表达式，分支与简单循环
 * 请根据注释里的相应提示，完成 *TODO* 部分的作业内容
 * 
 * © Tina J, 2021
 * 作者：Tina Ji
 * 时间：27/06/2021
 * 版本：1.0.0
 */

#include <iostream>
using namespace std;

// TODO:
// 上一个作业中，我们利用了if条件语句对分数进行判断
// 但是每次运行程序只能判断一个分数
// 我们首先要读入一个数字，表示后面会有多少个分数
// 使用循环对每一个分数进行判断（for循环 while循环都可以），请注意循环的条件哦
// 判断部分可以直接抄上一题的代码
// ---------------------Extension---------------------
// 现在我们规定-1是一个特殊的数字，如果读到了-1，我们就退出循环

int main(void) {

    return 0;
}